  #include <iostream>
#include "TXLib.h"
using namespace std;
int main()
{
	char MyName[256] = "";
int age = 0;
int x = 0;
char KKK[256] = "";
	cout << "ВАНЯ ИДИОТТТ: " << endl;
	cin >> MyName; 			  //при выполнении программы
							  //с помощью клавиатуры введите имя и фамилию,
							  //разделенные пробелом
							  //например: Ivan Petrov
							  //нажмите Enter для завершения ввода
	cout << "Ты прав" << "\n";
    txSleep (10);
	cout << "как тебя зовут?" << "\n";
	cin >> MyName;
	cout << "а МЕНЯ евлампий"<< "\n";
   cout << "сколько тебе лет?"<< "\n";
   cin >> age;
    if (age > 18){
    cout << "ну ты малолетка"<< "\n";
   }
   else {
     cout << "оу да ты старый"<< "\n";
   }
     cout << "кстати"<< "\n";
      cin >> KKK;
    txSleep (10000);
    cout << "забыл сказать что стоимость общения с ботом в минуту составляет 1000 рублей"<< "\n";
cin >> KKK;
txSleep (10000);

cout << "кто прочитал тот ЗДОХНЕТ!"<< "\n";
txSleep (1000);


while (x=1){

cout << "ты лох,,поймал вирус"<< "\n";
cout << "ахахаха"<< "\n";
cout << "чтобы отключить переведи деньги на номер 88002287845"<< "\n";
}

	txSleep(30);
	return 0;

}

